## 난수

In [1]:
import numpy as np

In [2]:
np.random.randint(20)

11

In [16]:
np.random.randint(2, 5)

2

In [62]:
np.random.seed(0)

In [63]:
np.random.rand(5)

array([0.5488135 , 0.71518937, 0.60276338, 0.54488318, 0.4236548 ])

In [68]:
np.random.seed(8)

In [69]:
np.random.rand(10)

array([0.8734294 , 0.96854066, 0.86919454, 0.53085569, 0.23272833,
       0.0113988 , 0.43046882, 0.40235136, 0.52267467, 0.4783918 ])

## 산술 함수

In [71]:
x = np.array([1, 2, 3, 4])
x

array([1, 2, 3, 4])

In [72]:
np.sum(x)

10

In [73]:
x.sum()

10

In [74]:
x = np.array([[1, 1], [2, 2]])
x

array([[1, 1],
       [2, 2]])

In [75]:
x.sum()

6

In [77]:
x.sum(axis = 0) # columns

array([3, 3])

In [78]:
x.sum(axis = 1) # rows

array([2, 4])

In [79]:
x = np.array([1, 3, 2, 5])
x

array([1, 3, 2, 5])

In [80]:
x.min()

1

In [81]:
x.max()

5

In [82]:
x.argmin()

0

In [84]:
x.argmax()

3

In [85]:
x.mean()

2.75

In [86]:
np.median(x) # 중간 값

2.5

In [88]:
a = np.zeros((100, 100))
a

array([[0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       ...,
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.]])

In [89]:
np.any(a != 0)

False

In [90]:
b = np.zeros((100, 100))
b[10, 10] = 1
b

array([[0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       ...,
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.]])

In [91]:
np.all(a == b)

False

## 문제4

In [93]:
x = np.random.rand(30)
x

array([0.06869013, 0.60364448, 0.79557456, 0.03200816, 0.45544782,
       0.79017254, 0.98859652, 0.58396454, 0.0389123 , 0.44642291,
       0.18817252, 0.62705565, 0.2153178 , 0.15097011, 0.53614431,
       0.10038679, 0.73115843, 0.93965104, 0.94331818, 0.37473851,
       0.59575025, 0.66198271, 0.51058046, 0.47089258, 0.00887229,
       0.0678964 , 0.43481623, 0.43149363, 0.18588369, 0.52970532])

In [98]:
x = x.reshape([5, 6])
x

array([[0.06869013, 0.60364448, 0.79557456, 0.03200816, 0.45544782,
        0.79017254],
       [0.98859652, 0.58396454, 0.0389123 , 0.44642291, 0.18817252,
        0.62705565],
       [0.2153178 , 0.15097011, 0.53614431, 0.10038679, 0.73115843,
        0.93965104],
       [0.94331818, 0.37473851, 0.59575025, 0.66198271, 0.51058046,
        0.47089258],
       [0.00887229, 0.0678964 , 0.43481623, 0.43149363, 0.18588369,
        0.52970532]])

### 1.

In [95]:
x.max()

0.9885965181137293

### 2.

In [99]:
x.sum(axis = 1)

array([2.74553769, 2.87312443, 2.67362848, 3.55726268, 1.65866755])

### 3.

In [100]:
x.mean(axis = 0)

array([0.44495898, 0.35624281, 0.48023953, 0.33445884, 0.41424858,
       0.67149543])

## 정렬

In [101]:
a = np.array([[4, 3, 5, 7], [1, 12, 11, 9], [2, 15, 1, 14]])
a

array([[ 4,  3,  5,  7],
       [ 1, 12, 11,  9],
       [ 2, 15,  1, 14]])

In [102]:
np.sort(a)

array([[ 3,  4,  5,  7],
       [ 1,  9, 11, 12],
       [ 1,  2, 14, 15]])

In [103]:
np.sort(a, axis = 0)

array([[ 1,  3,  1,  7],
       [ 2, 12,  5,  9],
       [ 4, 15, 11, 14]])

In [104]:
np.sort(a, axis = 1)

array([[ 3,  4,  5,  7],
       [ 1,  9, 11, 12],
       [ 1,  2, 14, 15]])

In [106]:
a.sort(axis = 1)
a

array([[ 3,  4,  5,  7],
       [ 1,  9, 11, 12],
       [ 1,  2, 14, 15]])

In [113]:
a = np.array([42, 38, 12, 25])
j = np.argsort(a) # 작은 값부터 데이터의 index를 나열
j

array([2, 3, 1, 0], dtype=int64)

In [114]:
a[j]

array([12, 25, 38, 42])

In [115]:
np.sort(a)

array([12, 25, 38, 42])

In [116]:
aa = np.array([[22, 3, 6, 9, 12, 15], 
               [4, 2, 1, 6, 8, 3], 
               [20, 20, 20, 20, 20, 20], 
               [30, 30, 30, 30, 30, 30], 
               [40, 40, 40, 40, 40, 40]])
aa

array([[22,  3,  6,  9, 12, 15],
       [ 4,  2,  1,  6,  8,  3],
       [20, 20, 20, 20, 20, 20],
       [30, 30, 30, 30, 30, 30],
       [40, 40, 40, 40, 40, 40]])

In [117]:
aa[ : , 0]

array([22,  4, 20, 30, 40])

In [118]:
np.argsort(aa[ : , 0])

array([1, 2, 0, 3, 4], dtype=int64)

In [121]:
aa[np.argsort(aa[ : , 0]), : ] # 첫 번째 열 값으로 모든 행 정렬

array([[ 4,  2,  1,  6,  8,  3],
       [20, 20, 20, 20, 20, 20],
       [22,  3,  6,  9, 12, 15],
       [30, 30, 30, 30, 30, 30],
       [40, 40, 40, 40, 40, 40]])

In [122]:
aa[ : , np.argsort(aa[1,  : ])] # 두 번째 행 값으로 모든 열 정렬

array([[ 6,  3, 15, 22,  9, 12],
       [ 1,  2,  3,  4,  6,  8],
       [20, 20, 20, 20, 20, 20],
       [30, 30, 30, 30, 30, 30],
       [40, 40, 40, 40, 40, 40]])

# Pandas

In [123]:
import pandas as pd

## Series

In [124]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [125]:
type(obj)

pandas.core.series.Series

In [126]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [127]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [129]:
obj2 = pd.Series([4, 7, -5, 3], index = ['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [130]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [131]:
obj2.values

array([ 4,  7, -5,  3], dtype=int64)

In [132]:
obj2['a']

-5

In [133]:
obj2[obj2 > 0]

d    4
b    7
c    3
dtype: int64

In [134]:
obj2*2

d     8
b    14
a   -10
c     6
dtype: int64

In [135]:
s = pd.Series([990, 344, 289, 646], 
              index = ['서울', '부산', '인천', '대구'])
s

서울    990
부산    344
인천    289
대구    646
dtype: int64

In [139]:
s.name = "인구"
s.index.name = "도시"
s

도시
서울    990
부산    344
인천    289
대구    646
Name: 인구, dtype: int64

In [141]:
s[1], s["부산"]

(344, 344)

In [142]:
s[['서울', '대구', '부산']]

도시
서울    990
대구    646
부산    344
Name: 인구, dtype: int64

In [143]:
s[[0, 3, 1]]

도시
서울    990
대구    646
부산    344
Name: 인구, dtype: int64

In [144]:
s[(300 < s) & (s < 900)]

도시
부산    344
대구    646
Name: 인구, dtype: int64

In [145]:
s[1:3]

도시
부산    344
인천    289
Name: 인구, dtype: int64

In [146]:
s["부산":"대구"]

도시
부산    344
인천    289
대구    646
Name: 인구, dtype: int64

In [147]:
s0 = pd.Series(range(3), index = ['a', 'b', 'c'])
s0

a    0
b    1
c    2
dtype: int64

In [148]:
s0.b

1

In [149]:
s0.a

0

In [150]:
s.부산

344

In [151]:
s.대구

646

In [157]:
s = pd.Series([9904315, 3448737, 2890451, 2466052], 
              index = ['서울', '부산', '인천', '대구'])
s

서울    9904315
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [164]:
s2 = pd.Series({"서울":9631482, "부산":3393191, "대전":1490158, "인천":2632035}, 
               index = ["부산", "서울", "인천", "대전"]) # 딕셔너리는 순서 x
s2

부산    3393191
서울    9631482
인천    2632035
대전    1490158
dtype: int64

In [165]:
ds = s - s2 # np.inf : 무한대, np.nan : 정의되지 않음, nan 값은 float64에서만 가능
ds

대구         NaN
대전         NaN
부산     55546.0
서울    272833.0
인천    258416.0
dtype: float64

In [166]:
s.values

array([9904315, 3448737, 2890451, 2466052], dtype=int64)

In [167]:
s2.values

array([3393191, 9631482, 2632035, 1490158], dtype=int64)

In [168]:
s.values - s2.values

array([ 6511124, -6182745,   258416,   975894], dtype=int64)

In [170]:
ds.notnull()

대구    False
대전    False
부산     True
서울     True
인천     True
dtype: bool

In [171]:
ds[ds.notnull()]

부산     55546.0
서울    272833.0
인천    258416.0
dtype: float64

## DataFrame

In [172]:
data = {
    "2015" : [9904312, 3448737, 2890451, 2466052], 
    "2010" : [9631482, 3393191, 2632035, 2431774], 
    "2005" : [9762546, 3512547, 2517680, 2456016], 
    "2000" : [9853972, 3655437, 2466338, 2473990], 
    "지역" : ["수도권", "경상권", "수도권", "경상권"], 
    "2010-2015 증가율" : [0.0283, 0.0163, 0.0982, 0.0141]
}
data

{'2015': [9904312, 3448737, 2890451, 2466052],
 '2010': [9631482, 3393191, 2632035, 2431774],
 '2005': [9762546, 3512547, 2517680, 2456016],
 '2000': [9853972, 3655437, 2466338, 2473990],
 '지역': ['수도권', '경상권', '수도권', '경상권'],
 '2010-2015 증가율': [0.0283, 0.0163, 0.0982, 0.0141]}

In [173]:
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index = index, columns = columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [174]:
df.values

array([['수도권', 9904312, 9631482, 9762546, 9853972, 0.0283],
       ['경상권', 3448737, 3393191, 3512547, 3655437, 0.0163],
       ['수도권', 2890451, 2632035, 2517680, 2466338, 0.0982],
       ['경상권', 2466052, 2431774, 2456016, 2473990, 0.0141]], dtype=object)

In [175]:
df.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [176]:
df.columns

Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object')

In [177]:
df["2015"]

서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 2015, dtype: int64

In [178]:
df["2015"].values

array([9904312, 3448737, 2890451, 2466052], dtype=int64)

In [179]:
df["2010-2015 증가율"] = df["2010-2015 증가율"] * 100
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972           2.83
부산  경상권  3448737  3393191  3512547  3655437           1.63
인천  수도권  2890451  2632035  2517680  2466338           9.82
대구  경상권  2466052  2431774  2456016  2473990           1.41

In [180]:
df["2005-2010 증가율"] = ((df["2010"] - df["2005"]) / df["2005"] * 100).round(2)
df

     지역     2015     2010     2005     2000  2010-2015 증가율  2005-2010 증가율
서울  수도권  9904312  9631482  9762546  9853972           2.83          -1.34
부산  경상권  3448737  3393191  3512547  3655437           1.63          -3.40
인천  수도권  2890451  2632035  2517680  2466338           9.82           4.54
대구  경상권  2466052  2431774  2456016  2473990           1.41          -0.99

In [185]:
df["지역"]

서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object

In [183]:
df[["지역"]]

     지역
서울  수도권
부산  경상권
인천  수도권
대구  경상권

In [182]:
df[["2010", "2015"]]

       2010     2015
서울  9631482  9904312
부산  3393191  3448737
인천  2632035  2890451
대구  2431774  2466052

In [184]:
type(df[["지역"]])

pandas.core.frame.DataFrame

In [186]:
df[ : 1]

     지역     2015     2010     2005     2000  2010-2015 증가율  2005-2010 증가율
서울  수도권  9904312  9631482  9762546  9853972           2.83          -1.34

In [187]:
df[1 : 2]

     지역     2015     2010     2005     2000  2010-2015 증가율  2005-2010 증가율
부산  경상권  3448737  3393191  3512547  3655437           1.63           -3.4

In [188]:
df[1 : 3]

     지역     2015     2010     2005     2000  2010-2015 증가율  2005-2010 증가율
부산  경상권  3448737  3393191  3512547  3655437           1.63          -3.40
인천  수도권  2890451  2632035  2517680  2466338           9.82           4.54

In [189]:
df["서울" : "부산"]

     지역     2015     2010     2005     2000  2010-2015 증가율  2005-2010 증가율
서울  수도권  9904312  9631482  9762546  9853972           2.83          -1.34
부산  경상권  3448737  3393191  3512547  3655437           1.63          -3.40

In [190]:
df["2015"]["부산"]

3448737

In [191]:
df["2010"]["대구"]

2431774

## 고급 인덱싱

In [192]:
df = pd.DataFrame(np.arange(10, 22).reshape(3, 4), 
                  index = ["a", "b", "c"], 
                  columns = ["A", "B", "C", "D"])
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [193]:
df.loc['a']

A    10
B    11
C    12
D    13
Name: a, dtype: int32

In [194]:
df.loc['b':'c']

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [195]:
df['b':'c']

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [196]:
df.loc[["b", "c"]]

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [197]:
df.A > 15

a    False
b    False
c     True
Name: A, dtype: bool

In [198]:
df.loc[df.A > 15]

    A   B   C   D
c  18  19  20  21

In [199]:
def select_rows(df):
    return df.A > 15

select_rows(df)

a    False
b    False
c     True
Name: A, dtype: bool

In [200]:
df.loc[select_rows(df)]

    A   B   C   D
c  18  19  20  21

In [203]:
df.loc[:, 'A']

a    10
b    14
c    18
Name: A, dtype: int32

In [204]:
df.loc["a", "A"]

10

In [205]:
df.loc["b":  , "A"]

b    14
c    18
Name: A, dtype: int32

In [206]:
df.loc["a",  : ]

A    10
B    11
C    12
D    13
Name: a, dtype: int32

In [207]:
df.loc[["a", "b"], ["B", "D"]]

    B   D
a  11  13
b  15  17

In [208]:
df.loc[df.A > 10, ["C", "D"]]

    C   D
b  16  17
c  20  21

In [209]:
df.iloc[0, 1]

11

In [210]:
df.iloc[ :2, 2]

a    12
b    16
Name: C, dtype: int32

In [211]:
df.iloc[0, -2: ]

C    12
D    13
Name: a, dtype: int32

In [212]:
df.iloc[2:3, 1:3]

    B   C
c  19  20

In [213]:
df.iloc[-1]

A    18
B    19
C    20
D    21
Name: c, dtype: int32

In [214]:
df.iloc[-1] = df.iloc[-1]*2
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  36  38  40  42

## 함수

In [217]:
s = pd.Series(range(10))
s[3] = np.nan
s

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [216]:
s.count()

9

In [218]:
np.random.seed(2)
df = pd.DataFrame(np.random.randint(5, size=(4, 4)), dtype=float)
df.iloc[2, 3] = np.nan
df

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [219]:
df.count()

0    4
1    4
2    4
3    3
dtype: int64

In [220]:
data = np.array([[80, 90, 90], [90, 70, 60], [70, 60, 80], [30, 40, 70]])
index = ['춘향', '몽룡', '향단', '방자']
columns = ['국어', '영어', '수학']
df = pd.DataFrame(data, index = index, columns = columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [221]:
df.sort_values(by='국어')

    국어  영어  수학
방자  30  40  70
향단  70  60  80
춘향  80  90  90
몽룡  90  70  60

In [222]:
df.sort_values(by=['국어', '수학'])

    국어  영어  수학
방자  30  40  70
향단  70  60  80
춘향  80  90  90
몽룡  90  70  60

In [223]:
df.sum(axis = 1)

춘향    260
몽룡    220
향단    210
방자    140
dtype: int64

In [224]:
df["RowSum"] = df.sum(axis = 1)
df

    국어  영어  수학  RowSum
춘향  80  90  90     260
몽룡  90  70  60     220
향단  70  60  80     210
방자  30  40  70     140

In [225]:
df.sum()

국어        270
영어        260
수학        300
RowSum    830
dtype: int64

In [227]:
df.loc["ColTotal",  : ] = df.sum()
df

             국어     영어     수학  RowSum
춘향         80.0   90.0   90.0   260.0
몽룡         90.0   70.0   60.0   220.0
향단         70.0   60.0   80.0   210.0
방자         30.0   40.0   70.0   140.0
ColTotal  270.0  260.0  300.0   830.0

## 문제6

In [242]:
data = np.array([[80, 90, 90], [90, 70, 60], [70, 60, 80], [30, 40, 70]])
index = ['춘향', '몽룡', '향단', '방자']
columns = ['국어', '영어', '수학']
df = pd.DataFrame(data, index = index, columns = columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

## 문제7

### 1.

In [229]:
df.loc[ : , '수학']

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int32

### 2.

In [230]:
df[['국어', '영어']]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

### 3.

In [243]:
df['Mean'] = df.mean(axis = 1).round(1)
df

    국어  영어  수학  Mean
춘향  80  90  90  86.7
몽룡  90  70  60  73.3
향단  70  60  80  70.0
방자  30  40  70  46.7

### 4.

In [245]:
df.loc['방자', '영어'] = 80
df['Mean'] = df.mean(axis = 1).round(1)
df

    국어  영어  수학  Mean
춘향  80  90  90  86.7
몽룡  90  70  60  73.3
향단  70  60  80  70.0
방자  30  80  70  59.2

### 5.

In [246]:
df[:1]

    국어  영어  수학  Mean
춘향  80  90  90  86.7